#Павлюк Владислав
#Робота світлофора для водіїв запрограмована таким чином: на початку кожної
#години протягом трьох хвилин горить зелений сигнал, потім протягом однієї хвилини -
#жовтий, протягом двох хвилин - червоний, протягом трьох хвилин - знову зелений і т. д.
#Розробити програму, яка вводить дійсне число t, що означає час в хвилинах, що
#минув з початку чергової години і визначає сигнал якого кольору горить для водіїв в цей
#момент.
while True:
 while True:
    try:
        t=int(input('Введите минуту:'))
        break
    except ValueError:
        print('s')
 while t<0 or t>60:
     t=int(input('Введите минуту!'))
 svet=t%6
 if 0<=svet<3:
     print('Зеленый')
 elif 3<=svet<=4:
     print('Желтый')
 else:
     print('Красный')
 result = input('Хочете запустити заново? Якщо так - 1, ні - інше: ')
 if result == '1':
  continue
 else:
   break
